Open-CMSIS-Pack/NXP_iMXRT105x_MWP/CMSIS/Driver/FLEXCAN_iMXRT105x.c
/* -------------------------------------------------------------------------- 
 * Copyright (c) 2019-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        4. October 2023
 * $Revision:    V1.9
 *
 * Driver:       Driver_CAN1/2
 * Configured:   pin/clock configuration via MCUXpresso Config Tools v7.0
 * Project:      CMSIS CAN Driver for NXP i.MX RT 105x Series
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   CAN Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_CAN# = 1       use FLEXCAN1
 *   Connect to hardware via Driver_CAN# = 2       use FLEXCAN2
 * --------------------------------------------------------------------------
 * Defines used for driver configuration (at compile time):
 *   CAN_CLOCK_TOLERANCE:               defines maximum allowed clock tolerance in 1/1024 steps
 *     - default value:                 15  (approx. 1.5 %)
 *
 *   CAN1 controller configuration:
 *   CAN1_RX_FIFO_EN:                   Rx FIFO enable
 *                                      (default=enabled)
 *   CAN1_RX_FIFO_ID_FILT_ELEM_NUM:     Number of receive FIFO ID filter elements
 *                                      (default=64, min=8, max=128)
 *
 *   CAN2 controller configuration:
 *   CAN2_RX_FIFO_EN:                   Rx FIFO enable
 *                                      (default=enabled)
 *   CAN2_RX_FIFO_ID_FILT_ELEM_NUM:     Number of receive FIFO ID filter elements
 *                                      (default=64, min=8, max=128)
 * Notes:
 *  - ARM_CAN_OBJ_RX_RTR_TX_DATA object type not supported
 *  - DMA not supported
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.9
 *    Added volatile qualifier to volatile variables
 *  Version 1.8
 *    Updated StartReceive function to work with FSL_FLEXCAN driver v2.9.2 or newer
 *  Version 1.7
 *    Corrected SetMode function to update unit state
 *  Version 1.6
 *    Corrected ObjectSetFilter function (uninitialized 'mask' variable value)
 *  Version 1.5
 *    Added support for maskable filtering
 *    Corrected index handling for Rx mailbox objects
 *    Corrected filter removal
 *  Version 1.4
 *    Added define instances (DRIVER_CAN1, DRIVER_CAN2)
 *  Version 1.3
 *    Added signaling of overrun events
 *  Version 1.2
 *    Changed Tx mailbox handling to support Errata 5829 correction in 
 *    fsl_flaxcan.c module
 *    (Tx mailbox is mapped to fsl flexcan as 1 higher than actual, because 
 *     first tx mailbox is reserved for errata workaround)
 *  Version 1.1
 *    Corrected SetMode function (endless wait on FRZACK bit)
 *  Version 1.0
 *    Initial release
 */

/*! \page evkb_imxrt1050_can CMSIS-Driver for CAN Interface

<b>CMSIS-Driver for CAN Interface Setup</b>

The CMSIS-Driver for CAN Interface requires:
  - CAN Pins
  - CAN Clock
 
Valid pin settings for <b>CAN</b> peripheral on <b>EVKB-IMXRT1050</b> evaluation board are listed in the table below:
 
|  #  | Peripheral | Signal     | Route to      | Direction     | Software Input On | Speed      |
|:----|:-----------|:-----------|:--------------|:--------------|:------------------|:-----------|
| H14 | CAN2       | TX         | GPIO_AD_B0_14 | Output        |     Enabled       | low(50MHz) |
| L10 | CAN2       | RX         | GPIO_AD_B0_15 | Input         |     Enabled       | low(50MHz) |
 
The rest of the settings can be at the default (reset) value.

For other boards or custom hardware, refer to the hardware schematics to reflect correct setup values.
 
In the \ref config_pinclock "MCUXpresso Config Tools", make sure that the following pin and clock settings are made (enter
the values that are shown in <em>italics</em>):
 
-# Under the \b Functional \b Group entry in the toolbar, select <b>Board_InitCAN</b>
-# Modify Routed Pins configuration to match the settings listed in the table above
-# Click on the flag next to <b>Functional Group BOARD_InitCAN</b> to enable calling that function from initialization code
-# Go to <b>Tools - Clocks</b>
-# Go to <b>Views - Clocks Diagram</b> and check that \b CAN clock is set to <em>40 MHz</em>
-# Click on <b>Update Project</b> button to update source files

\note
Driver limitations:
  - ARM_CAN_OBJ_RX_RTR_TX_DATA object type not supported
  - DMA not supported
*/

/*! \cond */

#include <stdint.h>
#include <string.h>

#include "Driver_CAN.h"

#include "RTE_Components.h"

#include "fsl_clock.h"
#include "fsl_flexcan.h"

/* Define instances */
#ifndef DRIVER_CAN1
  #define DRIVER_CAN1             1
#endif

#ifndef DRIVER_CAN2
  #define DRIVER_CAN2             0
#endif

// Driver configuration through compile-time definitions ------

// Maximum allowed clock tolerance in 1/1024 steps
#ifndef CAN_CLOCK_TOLERANCE
#define CAN_CLOCK_TOLERANCE            (15U)    // 15/1024 approx. 1.5 %
#endif

// CAN1 configuration
#ifndef CAN1_RX_FIFO_EN
#define CAN1_RX_FIFO_EN                (1U)
#endif
#if    (CAN1_RX_FIFO_EN == 1U)
#ifndef CAN1_RX_FIFO_ID_FILT_ELEM_NUM
#define CAN1_RX_FIFO_ID_FILT_ELEM_NUM  (64U)
#endif
#if    (CAN1_RX_FIFO_ID_FILT_ELEM_NUM <  8U)
#error  Not enough Rx FIFO ID Filter Elements defined for CAN1, minimum is 8 !!!
#elif  (CAN1_RX_FIFO_ID_FILT_ELEM_NUM > 128U)
#error  Too many Rx FIFO ID Filter Elements defined for CAN1, maximum is 128 !!!
#endif
#endif

// CAN2 configuration
#ifndef CAN2_RX_FIFO_EN         
#define CAN2_RX_FIFO_EN                (1U)
#endif
#if    (CAN2_RX_FIFO_EN == 1U)
#ifndef CAN2_RX_FIFO_ID_FILT_ELEM_NUM
#define CAN2_RX_FIFO_ID_FILT_ELEM_NUM  (64U)
#endif
#if    (CAN2_RX_FIFO_ID_FILT_ELEM_NUM <  8U)
#error  Not enough Rx FIFO ID Filter Elements defined for CAN2, minimum is 8 !!!
#elif  (CAN2_RX_FIFO_ID_FILT_ELEM_NUM > 128U)
#error  Too many Rx FIFO ID Filter Elements defined for CAN2, maximum is 128 !!!
#endif
#endif

// Compile-time calculations
#define CAN1_RX_FIFO_MBX_NUM           (CAN1_RX_FIFO_EN*(6U+((CAN1_RX_FIFO_ID_FILT_ELEM_NUM+3U)/4U)))
#if    (CAN1_RX_FIFO_MBX_NUM != 0)
#define CAN1_RX_FIFO_OBJ_NUM           (1U)
#define CAN1_RX_MBX_OBJ_OFS            (CAN1_RX_FIFO_MBX_NUM - 1U)
#else
#define CAN1_RX_FIFO_OBJ_NUM           (0U)
#define CAN1_RX_MBX_OBJ_OFS            (0U)
#endif
#define CAN1_MBX_OBJ_NUM               (64U-CAN1_RX_FIFO_MBX_NUM)
#define CAN1_TOT_OBJ_NUM               (CAN1_RX_FIFO_OBJ_NUM+CAN1_MBX_OBJ_NUM)

#define CAN2_RX_FIFO_MBX_NUM           (CAN2_RX_FIFO_EN*(6U+((CAN2_RX_FIFO_ID_FILT_ELEM_NUM+3U)/4U)))
#if    (CAN2_RX_FIFO_MBX_NUM != 0)
#define CAN2_RX_FIFO_OBJ_NUM           (1U)
#define CAN2_RX_MBX_OBJ_OFS            (CAN2_RX_FIFO_MBX_NUM - 1U)
#else
#define CAN2_RX_FIFO_OBJ_NUM           (0U)
#define CAN2_RX_MBX_OBJ_OFS            (0U)
#endif
#define CAN2_MBX_OBJ_NUM               (64U-CAN2_RX_FIFO_MBX_NUM)
#define CAN2_TOT_OBJ_NUM               (CAN2_RX_FIFO_OBJ_NUM+CAN2_MBX_OBJ_NUM)


// CAN Driver ******************************************************************

