Open-CMSIS-Pack/NXP_iMXRT105x_MWP/CMSIS/Driver/FLEXCAN_iMXRT105x.c
#define ARM_CAN_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,9) // CAN driver version

// Driver Version
static const ARM_DRIVER_VERSION can_driver_version = { ARM_CAN_API_VERSION, ARM_CAN_DRV_VERSION };

// Driver Capabilities
static const ARM_CAN_CAPABILITIES can_driver_capabilities[2] = {
#if (DRIVER_CAN1 == 1U)
  {                                     // CAN1 driver capabilities
    CAN1_TOT_OBJ_NUM,                   // Number of CAN Objects available
    1U,                                 // Supports reentrant calls to ARM_CAN_MessageSend, ARM_CAN_MessageRead, ARM_CAN_ObjectConfigure and abort message sending used by ARM_CAN_Control.
    0U,                                 // Does not support CAN with flexible data-rate mode (CAN_FD)
    0U,                                 // Does not support restricted operation mode
    1U,                                 // Supports bus monitoring mode
    1U,                                 // Supports internal loopback mode
    0U,                                 // Supports external loopback mode
    0U                                  // Reserved field = 0
  },
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U },
#endif
#if (DRIVER_CAN2 == 1U)
  {                                     // CAN2 driver capabilities
    CAN2_TOT_OBJ_NUM,                   // Number of CAN Objects available
    1U,                                 // Supports reentrant calls to ARM_CAN_MessageSend, ARM_CAN_MessageRead, ARM_CAN_ObjectConfigure and abort message sending used by ARM_CAN_Control.
    0U,                                 // Does not support CAN with flexible data-rate mode (CAN_FD)
    0U,                                 // Does not support restricted operation mode
    1U,                                 // Supports bus monitoring mode
    1U,                                 // Supports internal loopback mode
    0U,                                 // Supports external loopback mode
    0U                                  // Reserved field = 0
  }
#else
  { 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U }
#endif
};

// Object Capabilities
static const ARM_CAN_OBJ_CAPABILITIES can_object_capabilities_rx_fifo = { 
                                        // Rx FIFO object capabilities
  0U,                                   // Object does not support transmission
  1U,                                   // Object supports reception
  0U,                                   // Object does not support RTR reception and automatic Data transmission
  0U,                                   // Object does not support RTR transmission and automatic Data reception
  1U,                                   // Object allows assignment of multiple filters to it
  1U,                                   // Object supports exact identifier filtering
  0U,                                   // Object does not support range identifier filtering
  1U,                                   // Object supports mask identifier filtering
  6U,                                   // Object can buffer 6 messages
  0U                                    // Reserved field = 0
};
static const ARM_CAN_OBJ_CAPABILITIES can_object_capabilities_mbx = {
                                        // Mailbox object capabilities
  1U,                                   // Object supports transmission
  1U,                                   // Object supports reception
  0U,                                   // Object does not support RTR reception and automatic Data transmission
  0U,                                   // Object does not support RTR transmission and automatic Data reception
  0U,                                   // Object does not allow assignment of multiple filters to it
  1U,                                   // Object supports exact identifier filtering
  0U,                                   // Object does not support range identifier filtering
  1U,                                   // Object supports mask identifier filtering
  1U,                                   // Object can buffer 1 messages
  0U                                    // Reserved field = 0
};

typedef struct _CAN_DRV_CONFIG {        // Structure containing compile-time configuration of driver
  uint8_t TOT_OBJ_NUM;                  // Number of total objects (Rx FIFO object + Mailbox objects)
  uint8_t RX_FIFO_OBJ_NUM;              // Number of Rx FIFO objects
  uint8_t RX_MBX_OBJ_OFS;               // Offset of Mailbox because of FIFO usage of Mailboxes
  uint8_t RX_FIFO_MAX_FILT_NUM;         // Maximum number of filter IDs for Rx FIFO
} CAN_DRV_CONFIG_t;

// Compile time configuration of drivers
const  CAN_DRV_CONFIG_t CAN_DRV_CONFIG [2] = {
#if (DRIVER_CAN1 == 1U)
  { CAN1_TOT_OBJ_NUM,
    CAN1_RX_FIFO_OBJ_NUM,
    CAN1_RX_MBX_OBJ_OFS,
    CAN1_RX_FIFO_ID_FILT_ELEM_NUM
  },
#else
  { 0U, 0U, 0U, 0U },
#endif
#if (DRIVER_CAN2 == 1U)
  { CAN2_TOT_OBJ_NUM,
    CAN2_RX_FIFO_OBJ_NUM,
    CAN2_RX_MBX_OBJ_OFS,
    CAN2_RX_FIFO_ID_FILT_ELEM_NUM
  }
#else
  { 0U, 0U, 0U, 0U }
#endif
};

// Runtime variables
static volatile uint8_t            can_driver_powered    [2] = {   0U,   0U };
static volatile uint8_t            can_driver_initialized[2] = {   0U,   0U };
static volatile ARM_CAN_STATUS     can_status            [2];
static ARM_CAN_SignalUnitEvent_t   CAN_SignalUnitEvent   [2] = { NULL, NULL };
static ARM_CAN_SignalObjectEvent_t CAN_SignalObjectEvent [2] = { NULL, NULL };

static volatile uint32_t           can_obj_tx            [2][2];
static volatile uint32_t           can_obj_rx            [2][2];

static CAN_Type                   *can_base              [2] = { CAN1, CAN2 };
static uint8_t                     can_id_filter_num     [2];
static flexcan_config_t            flexcan_config        [2];
static flexcan_timing_config_t     timing_config         [2];
static flexcan_handle_t            flexcan_handle        [2];
#if (DRIVER_CAN1 == 1U)
static uint32_t                    can1_id_filter_table  [CAN1_RX_FIFO_ID_FILT_ELEM_NUM];
static volatile flexcan_frame_t    can1_frame            [CAN1_TOT_OBJ_NUM];
#if (CAN1_RX_FIFO_OBJ_NUM != 0U)
static flexcan_fifo_transfer_t     can1_fifo_transfer;
#endif
static flexcan_mb_transfer_t       can1_mbx_transfer     [CAN1_MBX_OBJ_NUM];
#endif
#if (DRIVER_CAN2 == 1U)
static uint32_t                    can2_id_filter_table  [CAN2_RX_FIFO_ID_FILT_ELEM_NUM];
static volatile flexcan_frame_t    can2_frame            [CAN2_TOT_OBJ_NUM];
#if (CAN2_RX_FIFO_OBJ_NUM != 0U)
static flexcan_fifo_transfer_t     can2_fifo_transfer;
#endif
static flexcan_mb_transfer_t       can2_mbx_transfer     [CAN2_MBX_OBJ_NUM];
#endif

