Open-CMSIS-Pack/NXP_iMXRT105x_MWP/CMSIS/Driver/FLEXCAN_iMXRT105x.c
// Local module functions
static uint32_t CAN_GetClock (void);
static void     IRQ_Callback (CAN_Type *base, flexcan_handle_t *handle, status_t status, uint32_t result, void *userData);


// CAN Driver Functions

/**
  \fn          ARM_DRIVER_VERSION CAN_GetVersion (void)
  \brief       Get driver version.
  \return      ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION CAN_GetVersion (void) { return can_driver_version; }

/**
  \fn          ARM_CAN_CAPABILITIES CAN1_GetCapabilities (void)
  \fn          ARM_CAN_CAPABILITIES CAN2_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      ARM_CAN_CAPABILITIES
*/
#if (DRIVER_CAN1 == 1U)
static ARM_CAN_CAPABILITIES CAN1_GetCapabilities (void) { return can_driver_capabilities[0U]; }
#endif
#if (DRIVER_CAN2 == 1U)
static ARM_CAN_CAPABILITIES CAN2_GetCapabilities (void) { return can_driver_capabilities[1U]; }
#endif
/**
  \fn          int32_t CANx_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                        ARM_CAN_SignalObjectEvent_t cb_object_event,
                                        uint8_t                     x)
  \brief       Initialize CAN interface and register signal (callback) functions.
  \param[in]   cb_unit_event   Pointer to ARM_CAN_SignalUnitEvent callback function
  \param[in]   cb_object_event Pointer to ARM_CAN_SignalObjectEvent callback function
  \param[in]   x               Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                ARM_CAN_SignalObjectEvent_t cb_object_event,
                                uint8_t                     x) {

  if (can_driver_initialized[x] != 0U) { return ARM_DRIVER_OK;    }

  CAN_SignalUnitEvent   [x] = cb_unit_event;
  CAN_SignalObjectEvent [x] = cb_object_event;

  can_driver_initialized[x] = 1U;

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_Initialize (ARM_CAN_SignalUnitEvent_t cb_unit_event, ARM_CAN_SignalObjectEvent_t cb_object_event) { return CANx_Initialize (cb_unit_event, cb_object_event, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_Initialize (ARM_CAN_SignalUnitEvent_t cb_unit_event, ARM_CAN_SignalObjectEvent_t cb_object_event) { return CANx_Initialize (cb_unit_event, cb_object_event, 1U); }
#endif

/**
  \fn          int32_t CANx_Uninitialize (uint8_t x)
  \brief       De-initialize CAN interface.
  \param[in]   x      Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_Uninitialize (uint8_t x) {

  can_driver_initialized[x] = 0U;

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_Uninitialize (void) { return CANx_Uninitialize (0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_Uninitialize (void) { return CANx_Uninitialize (1U); }
#endif

/**
  \fn          int32_t CANx_PowerControl (ARM_POWER_STATE state, uint8_t x)
  \brief       Control CAN interface power.
  \param[in]   state  Power state
                 - ARM_POWER_OFF :  power off: no operation possible
                 - ARM_POWER_LOW :  low power mode: retain state, detect and signal wake-up events
                 - ARM_POWER_FULL : power on: full operation at maximum performance
  \param[in]   x      Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_PowerControl (ARM_POWER_STATE state, uint8_t x) {
  flexcan_rx_fifo_config_t rx_fifo_config;

  switch (state) {
    case ARM_POWER_OFF:
      can_driver_powered[x] = 0U;
      FLEXCAN_Deinit(can_base[x]);
      can_obj_tx[x][0] = 0U;
      can_obj_tx[x][1] = 0U;
      can_obj_rx[x][0] = 0U;
      can_obj_rx[x][1] = 0U;
      can_status[x].unit_state      = 0U;
      can_status[x].last_error_code = 0U;
      can_status[x].tx_error_count  = 0U;
      can_status[x].rx_error_count  = 0U;
      break;

    case ARM_POWER_FULL:
      if (can_driver_initialized[x] == 0U) { return ARM_DRIVER_ERROR; }
      if (can_driver_powered[x]     != 0U) { return ARM_DRIVER_OK;    }

      // Reset variables
      memset((void *)&can_status[x], 0, sizeof(ARM_CAN_STATUS));

      // Load initial default values of timing configuration
      timing_config[x].preDivider = CAN_GetClock() / (flexcan_config[x].baudRate * (1U + (3U + 1U) + (2U + 1U) + (1U + 1U)));
      timing_config[x].phaseSeg1  = 3U;         // Phase segment 1 =     4 Tq
      timing_config[x].phaseSeg2  = 2U;         // Phase segment 2 =     3 Tq
      timing_config[x].propSeg    = 1U;         // Propagation segment = 2 Tq
      timing_config[x].rJumpwidth = 1U;         // SJW =                 2 Tq

      // Load FlexCAN module default Configuration
      //
      // clkSrc            = kFLEXCAN_ClkSrcOsc;
      // baudRate          = 1000000U;
      // maxMbNum          = 16;
      // enableLoopBack    = false;
      // enableSelfWakeup  = false;
      // enableIndividMask = false;
      // enableDoze        = false;
      //
      FLEXCAN_GetDefaultConfig(&flexcan_config[x]);

      // Update configuration to use all available mailboxes
      flexcan_config[x].maxMbNum = 64U;

      // Enable individual masking
      flexcan_config[x].enableIndividMask = 1U;

      // Initialize FlexCAN fsl driver
      FLEXCAN_Init(can_base[x], &flexcan_config[x], CAN_GetClock());

      // Set initial FIFO configuration if FIFO is enabled
      if (CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM != 0U) {
        if (x == 0U) {
#if (DRIVER_CAN1 == 1U)
          memset((void *)can1_id_filter_table, 0, sizeof(can1_id_filter_table));
          rx_fifo_config.idFilterTable = can1_id_filter_table;
#else
          return ARM_DRIVER_ERROR;
#endif
        } else if (x == 1U) {
#if (DRIVER_CAN2 == 1U)
          memset((void *)can2_id_filter_table, 0, sizeof(can2_id_filter_table));
          rx_fifo_config.idFilterTable = can2_id_filter_table;
#else
          return ARM_DRIVER_ERROR;
#endif
        }
        rx_fifo_config.idFilterNum  = CAN_DRV_CONFIG[x].RX_FIFO_MAX_FILT_NUM;
        rx_fifo_config.idFilterType = kFLEXCAN_RxFifoFilterTypeA;
        rx_fifo_config.priority     = kFLEXCAN_RxFifoPrioLow;
        can_id_filter_num[x] = 0U;

        FLEXCAN_SetRxFifoConfig(can_base[x], &rx_fifo_config, true);

        FLEXCAN_SetRxFifoGlobalMask(can_base[x], 0xFFFFFFFFUL);
      }
      FLEXCAN_SetRxMbGlobalMask(can_base[x], 0xFFFFFFFFUL);

