Open-CMSIS-Pack/NXP_iMXRT105x_MWP/CMSIS/Driver/FLEXCAN_iMXRT105x.c
      // Create FlexCAN handle structure and set callback function
      FLEXCAN_TransferCreateHandle(can_base[x], &flexcan_handle[x], IRQ_Callback, NULL);

      can_driver_powered[x] = 1U;
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_PowerControl (ARM_POWER_STATE state) { return CANx_PowerControl (state, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_PowerControl (ARM_POWER_STATE state) { return CANx_PowerControl (state, 1U); }
#endif

/**
  \fn          uint32_t CAN_GetClock (void)
  \brief       Retrieve CAN base clock frequency.
  \return      base clock frequency
*/
static uint32_t CAN_GetClock (void) {
  uint32_t val;

  switch ((CCM->CSCMR2 & CCM_CSCMR2_CAN_CLK_SEL_MASK) >> CCM_CSCMR2_CAN_CLK_SEL_SHIFT) {
    case 0:
      val = CLOCK_GetFreq(kCLOCK_Usb1PllClk) / 8;
      break;
    case 1:
      val = 24000000U;
      break;
    case 2:
      val = CLOCK_GetFreq(kCLOCK_Usb1PllClk) / 6;
      break;
    default:
      val = 0U;
      break;
  }
  val = val / (((CCM->CSCMR2 & CCM_CSCMR2_CAN_CLK_PODF_MASK) >> CCM_CSCMR2_CAN_CLK_PODF_SHIFT) + 1U);

  return val;
}


/**
  \fn          int32_t CANx_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments, uint8_t x)
  \brief       Set bitrate for CAN interface.
  \param[in]   select       Bitrate selection
                 - ARM_CAN_BITRATE_NOMINAL : nominal (flexible data-rate arbitration) bitrate
                 - ARM_CAN_BITRATE_FD_DATA : flexible data-rate data bitrate
  \param[in]   bitrate      Bitrate
  \param[in]   bit_segments Bit segments settings
  \param[in]   x            Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments, uint8_t x) {
  uint32_t sjw, prop_seg, phase_seg1, phase_seg2, pclk, tq_num, presdiv;

  if (select != ARM_CAN_BITRATE_NOMINAL) {
    return ARM_CAN_INVALID_BITRATE_SELECT;
  }

  prop_seg   = (bit_segments & ARM_CAN_BIT_PROP_SEG_Msk  ) >> ARM_CAN_BIT_PROP_SEG_Pos;
  phase_seg1 = (bit_segments & ARM_CAN_BIT_PHASE_SEG1_Msk) >> ARM_CAN_BIT_PHASE_SEG1_Pos;
  phase_seg2 = (bit_segments & ARM_CAN_BIT_PHASE_SEG2_Msk) >> ARM_CAN_BIT_PHASE_SEG2_Pos;
  sjw        = (bit_segments & ARM_CAN_BIT_SJW_Msk       ) >> ARM_CAN_BIT_SJW_Pos;

  if (  prop_seg               < 1U                                     ) { return ARM_CAN_INVALID_BIT_PROP_SEG;   }
  if (  phase_seg1             < 1U                                     ) { return ARM_CAN_INVALID_BIT_PHASE_SEG1; }
  if (((prop_seg + phase_seg1) < 4U) || ((prop_seg + phase_seg1) >  16U)) { return ARM_CAN_INVALID_BIT_PROP_SEG;   }
  if (( phase_seg2             < 2U) || ( phase_seg2             >   8U)) { return ARM_CAN_INVALID_BIT_PHASE_SEG2; }
  if (( sjw                    < 1U) || ( sjw                    >   4U)) { return ARM_CAN_INVALID_BIT_SJW;        }

  tq_num     = 1U + prop_seg + phase_seg1 + phase_seg2;
  pclk       = CAN_GetClock ();
  presdiv    = (pclk / tq_num) / bitrate;

  if (pclk == 0U)   { return ARM_DRIVER_ERROR; }
  if (presdiv < 1U) { return ARM_DRIVER_ERROR; }


  // Check selected clock bitrate is within expected tolerance
  if (pclk > (presdiv * tq_num * bitrate)) {
    if ((((pclk - (presdiv * tq_num * bitrate)) * 1024U) / pclk) > CAN_CLOCK_TOLERANCE) { return ARM_CAN_INVALID_BITRATE; }
  } else if (pclk < (presdiv * tq_num * bitrate)) {
    if (((((presdiv * tq_num * bitrate) - pclk) * 1024U) / pclk) > CAN_CLOCK_TOLERANCE) { return ARM_CAN_INVALID_BITRATE; }
  }

  // Set all parameters in required structure
  timing_config[x].preDivider = presdiv    - 1U;
  timing_config[x].phaseSeg1  = phase_seg1 - 1U;
  timing_config[x].phaseSeg2  = phase_seg2 - 1U;
  timing_config[x].propSeg    = prop_seg   - 1U;
  timing_config[x].rJumpwidth = sjw        - 1U;

  // Update actual timing characteristics
  FLEXCAN_SetTimingConfig(can_base[x], &timing_config[x]);

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments) { return CANx_SetBitrate (select, bitrate, bit_segments, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments) { return CANx_SetBitrate (select, bitrate, bit_segments, 1U); }
#endif

/**
  \fn          int32_t CANx_SetMode (ARM_CAN_MODE mode, uint8_t x)
  \brief       Set operating mode for CAN interface.
  \param[in]   mode   Operating mode
                 - ARM_CAN_MODE_INITIALIZATION :    initialization mode
                 - ARM_CAN_MODE_NORMAL :            normal operation mode
                 - ARM_CAN_MODE_RESTRICTED :        restricted operation mode
                 - ARM_CAN_MODE_MONITOR :           bus monitoring mode
                 - ARM_CAN_MODE_LOOPBACK_INTERNAL : loopback internal mode
                 - ARM_CAN_MODE_LOOPBACK_EXTERNAL : loopback external mode
  \param[in]   x      Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_SetMode (ARM_CAN_MODE mode, uint8_t x) {
  uint32_t event;
  bool     exit_freeze, loopback;

  exit_freeze = true;
  loopback    = 0U;
  event       = 0U;

  // Enter freeze mode, as all configuration change is allowed only in freeze mode
  can_base[x]->MCR |= CAN_MCR_HALT_MASK | CAN_MCR_FRZ_MASK;
  while (!(can_base[x]->MCR & CAN_MCR_FRZACK_MASK));

  switch (mode) {
    case ARM_CAN_MODE_INITIALIZATION:
      exit_freeze = false;
      can_status[x].unit_state = ARM_CAN_UNIT_STATE_INACTIVE;
      event                    = ARM_CAN_EVENT_UNIT_BUS_OFF;
      break;

    case ARM_CAN_MODE_NORMAL:
      can_status[x].unit_state = ARM_CAN_UNIT_STATE_ACTIVE;
      event                    = ARM_CAN_EVENT_UNIT_ACTIVE;
      break;

    case ARM_CAN_MODE_MONITOR:
      can_base[x]->CTRL1 |= CAN_CTRL1_LOM_MASK;
      can_status[x].unit_state = ARM_CAN_UNIT_STATE_PASSIVE;
      event                    = ARM_CAN_EVENT_UNIT_PASSIVE;
      break;

    case ARM_CAN_MODE_LOOPBACK_INTERNAL:
      loopback = true;
      can_status[x].unit_state = ARM_CAN_UNIT_STATE_PASSIVE;
      event                    = ARM_CAN_EVENT_UNIT_PASSIVE;
      break;

    case ARM_CAN_MODE_RESTRICTED:
      return ARM_DRIVER_ERROR_PARAMETER;

    case ARM_CAN_MODE_LOOPBACK_EXTERNAL:
      return ARM_DRIVER_ERROR_PARAMETER;

    default:
      return ARM_DRIVER_ERROR_PARAMETER;
  }

  flexcan_config[x].enableLoopBack = loopback;
  if (loopback == true) {
    can_base[x]->CTRL1 |=  CAN_CTRL1_LPB_MASK;
    can_base[x]->MCR   &= ~CAN_MCR_SRXDIS_MASK; // Enable self-reception
  } else {
    can_base[x]->CTRL1 &= ~CAN_CTRL1_LPB_MASK;
    can_base[x]->MCR   |=  CAN_MCR_SRXDIS_MASK; // Disable self-reception
  }

  if (exit_freeze == true) {
    // Exit freeze mode
    can_base[x]->MCR &= ~(CAN_MCR_HALT_MASK | CAN_MCR_FRZ_MASK);
    while (can_base[x]->MCR & CAN_MCR_FRZACK_MASK);
  }

  if ((CAN_SignalUnitEvent[x] != NULL) && (event != 0U)) { CAN_SignalUnitEvent[x](event); }

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_SetMode (ARM_CAN_MODE mode) { return CANx_SetMode (mode, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_SetMode (ARM_CAN_MODE mode) { return CANx_SetMode (mode, 1U); }
#endif

/**
  \fn          ARM_CAN_OBJ_CAPABILITIES CANx_ObjectGetCapabilities (uint32_t obj_idx, uint8_t x)
  \brief       Retrieve capabilities of an object.
  \param[in]   obj_idx  Object index
  \param[in]   x        Controller number (0..1)
  \return      ARM_CAN_OBJ_CAPABILITIES
*/
ARM_CAN_OBJ_CAPABILITIES CANx_ObjectGetCapabilities (uint32_t obj_idx, uint8_t x) {
  ARM_CAN_OBJ_CAPABILITIES obj_cap_null;

  if (obj_idx >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM) {
    memset ((void *)&obj_cap_null, 0, sizeof(ARM_CAN_OBJ_CAPABILITIES));
    return obj_cap_null;
  }

  if ((obj_idx == 0U) && (CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM != 0U)) {
    // Rx FIFO capabilities
    return can_object_capabilities_rx_fifo;
  } else {
    return can_object_capabilities_mbx;
  }
}
#if (DRIVER_CAN1 == 1U)
ARM_CAN_OBJ_CAPABILITIES CAN1_ObjectGetCapabilities (uint32_t obj_idx) { return CANx_ObjectGetCapabilities (obj_idx, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
ARM_CAN_OBJ_CAPABILITIES CAN2_ObjectGetCapabilities (uint32_t obj_idx) { return CANx_ObjectGetCapabilities (obj_idx, 1U); }
#endif

/**
  \fn          int32_t CANx_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg, uint8_t x)
  \brief       Add or remove filter for message reception.
  \param[in]   obj_idx      Object index of object that filter should be or is assigned to
  \param[in]   operation    Operation on filter
                 - ARM_CAN_FILTER_ID_EXACT_ADD :       add    exact id filter
                 - ARM_CAN_FILTER_ID_EXACT_REMOVE :    remove exact id filter
                 - ARM_CAN_FILTER_ID_RANGE_ADD :       add    range id filter
                 - ARM_CAN_FILTER_ID_RANGE_REMOVE :    remove range id filter
                 - ARM_CAN_FILTER_ID_MASKABLE_ADD :    add    maskable id filter
                 - ARM_CAN_FILTER_ID_MASKABLE_REMOVE : remove maskable id filter
  \param[in]   id           ID or start of ID range (depending on filter type)
  \param[in]   arg          Mask or end of ID range (depending on filter type)
  \param[in]   x            Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg, uint8_t x) {
  flexcan_rx_fifo_config_t rx_fifo_config;
  flexcan_rx_mb_config_t   rx_mb_config;
  uint32_t                *ptr_filter_table, id_entry, mbx_idx, mask;
  uint8_t                  i;

  if (obj_idx >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }
  if (can_driver_powered[x] == 0U)              { return ARM_DRIVER_ERROR;           }

  if ((operation == ARM_CAN_FILTER_ID_RANGE_ADD)    || 
      (operation == ARM_CAN_FILTER_ID_RANGE_REMOVE)) {
    // Range filters are not supported by HW
    return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  if ((obj_idx == 0U) && (CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM != 0U)) {   // Rx FIFO object
    if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {      // Extended Identifier
      id_entry = (id & 0x1FFFFFFFU) | (1U << 29);
    } else {                                    // Standard Identifier
      id_entry = (id & 0x7FFU) << CAN_ID_STD_SHIFT;
    }
    id_entry <<= 1U;                            // Filter ID entry contains shifted message ID
    if (x == 0U) {
#if (DRIVER_CAN1 == 1U)
      ptr_filter_table             = can1_id_filter_table;
      rx_fifo_config.idFilterTable = can1_id_filter_table;
#else
      return ARM_DRIVER_ERROR;
#endif
    } else {
#if (DRIVER_CAN2 == 1U)
      ptr_filter_table             = can2_id_filter_table;
      rx_fifo_config.idFilterTable = can2_id_filter_table;
#else
      return ARM_DRIVER_ERROR;
#endif
    }
    rx_fifo_config.idFilterType = kFLEXCAN_RxFifoFilterTypeA;
    rx_fifo_config.priority     = kFLEXCAN_RxFifoPrioLow;
    if ((operation == ARM_CAN_FILTER_ID_EXACT_ADD)    ||                // Add exact or
        (operation == ARM_CAN_FILTER_ID_MASKABLE_ADD)) {                // maskable filter
      if (can_id_filter_num[x] >= CAN_DRV_CONFIG[x].RX_FIFO_MAX_FILT_NUM) {
        // If no space to add new ID filter
        return ARM_DRIVER_ERROR;
      }
      if ((operation == ARM_CAN_FILTER_ID_MASKABLE_ADD) &&
          (can_id_filter_num[x] >= CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS)) {
        // If no individual mask for Rx FIFO filter table entry is available 
        return ARM_DRIVER_ERROR;
      }
      for (i = 0U; i < CAN_DRV_CONFIG[x].RX_FIFO_MAX_FILT_NUM; i++) {
        if (*ptr_filter_table == 0U) {                                  // Found empty ID filter slot
          break;
        }
        ptr_filter_table++;
      }
      *ptr_filter_table = id_entry;
      can_id_filter_num[x]++;

      if (operation == ARM_CAN_FILTER_ID_MASKABLE_ADD) {                // Add maskable filter
        if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {                          // Extended Identifier
          mask =  arg & 0x1FFFFFFFU;
        } else {                                                        // Standard Identifier
          mask = (arg & 0x7FFU) << CAN_ID_STD_SHIFT;
        }
        FLEXCAN_SetRxIndividualMask(can_base[x], can_id_filter_num[x] - 1U, mask);
      }
    } else {                                                            // Remove exact or maskable filter
      if (can_id_filter_num[x] == 0U) {
        // If no ID filter exists
        return ARM_DRIVER_OK;
      }
      for (i = 0U; i < CAN_DRV_CONFIG[x].RX_FIFO_MAX_FILT_NUM; i++) {
        if (*ptr_filter_table == id_entry) {                            // Found ID filter entry for removal
          *ptr_filter_table = 0U;
          break;
        }
        ptr_filter_table++;
      }
      if (i != CAN_DRV_CONFIG[x].RX_FIFO_MAX_FILT_NUM) {                // If entry to remove was found
        // Move all entries from found entry for one entry down
        if (operation == ARM_CAN_FILTER_ID_MASKABLE_REMOVE) {
          FLEXCAN_EnterFreezeMode(can_base[x]);
        }
        for (; i < CAN_DRV_CONFIG[x].RX_FIFO_MAX_FILT_NUM; i++) {
          /* Move filter table entry */
          *ptr_filter_table = *(ptr_filter_table+1);

