Open-CMSIS-Pack/NXP_iMXRT105x_MWP/CMSIS/Driver/FLEXCAN_iMXRT105x.c
          if (operation == ARM_CAN_FILTER_ID_MASKABLE_REMOVE) {
            if (i <= CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS) {
              /* Move individual mask entry */
              can_base[x]->RXIMR[i] = can_base[x]->RXIMR[i+1];
            }
          }

          ptr_filter_table++;
        }
        if (operation == ARM_CAN_FILTER_ID_MASKABLE_REMOVE) {
          FLEXCAN_ExitFreezeMode(can_base[x]);
        }
        *ptr_filter_table = 0U;
      }
      can_id_filter_num[x]--;
    }
    rx_fifo_config.idFilterNum = CAN_DRV_CONFIG[x].RX_FIFO_MAX_FILT_NUM;
    if (can_id_filter_num[x] != 0U) {
      FLEXCAN_SetRxFifoConfig(can_base[x], &rx_fifo_config, true);
    } else {
      FLEXCAN_SetRxFifoConfig(can_base[x], &rx_fifo_config, false);
    }
  } else {                                                              // Mailbox object
    mbx_idx = obj_idx + CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS + 1U;
    if ((operation == ARM_CAN_FILTER_ID_EXACT_ADD)    ||                // Add exact or
        (operation == ARM_CAN_FILTER_ID_MASKABLE_ADD)) {                // maskable filter
      if ((id & ARM_CAN_ID_IDE_Msk) != 0U) {                            // Extended Identifier
        mask     =  arg & 0x1FFFFFFFU;
        id_entry =  id  & 0x1FFFFFFFU;
        rx_mb_config.format = kFLEXCAN_FrameFormatExtend;
      } else {                                                          // Standard Identifier
        mask     = (arg & 0x7FFU) << CAN_ID_STD_SHIFT;
        id_entry = (id  & 0x7FFU) << CAN_ID_STD_SHIFT;
        rx_mb_config.format = kFLEXCAN_FrameFormatStandard;
      }
      rx_mb_config.id   = id_entry;
      rx_mb_config.type = kFLEXCAN_FrameTypeData;
      FLEXCAN_SetRxMbConfig(can_base[x], mbx_idx, &rx_mb_config, true);
      if (operation == ARM_CAN_FILTER_ID_MASKABLE_ADD) {                // Add maskable filter
        FLEXCAN_SetRxIndividualMask(can_base[x], mbx_idx, mask);
      }
    } else {                                                            // Remove
      if (operation == ARM_CAN_FILTER_ID_MASKABLE_REMOVE) {             // Remove maskable filter
        FLEXCAN_SetRxIndividualMask(can_base[x], mbx_idx, 0U);
      }
      memset((void *)&rx_mb_config, 0, sizeof(rx_mb_config));
      FLEXCAN_SetRxMbConfig(can_base[x], mbx_idx, &rx_mb_config, false);
    }
  }

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg) { return CANx_ObjectSetFilter (obj_idx, operation, id, arg, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_ObjectSetFilter (uint32_t obj_idx, ARM_CAN_FILTER_OPERATION operation, uint32_t id, uint32_t arg) { return CANx_ObjectSetFilter (obj_idx, operation, id, arg, 1U); }
#endif

/**
  \fn          int32_t CANx_StartReceive (uint32_t obj_idx, uint8_t x)
  \brief       Start reception on an object.
  \param[in]   obj_idx  Object index
  \param[in]   x        Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_StartReceive (uint32_t obj_idx, uint8_t x) {
  volatile flexcan_frame_t         *ptr_rx_frame;
           flexcan_mb_transfer_t   *ptr_rx_mbx_transfer;
           flexcan_fifo_transfer_t *ptr_rx_fifo_transfer;
           uint32_t                 mbx_idx;

  if (x == 0U) {
#if (DRIVER_CAN1 == 1U)
    ptr_rx_frame         = &can1_frame[obj_idx];
    ptr_rx_fifo_transfer = &can1_fifo_transfer;
    ptr_rx_mbx_transfer  = &can1_mbx_transfer[obj_idx];
#else
    return kStatus_Fail;
#endif
  } else {
#if (DRIVER_CAN2 == 1U)
    ptr_rx_frame         = &can2_frame[obj_idx];
    ptr_rx_fifo_transfer = &can2_fifo_transfer;
    ptr_rx_mbx_transfer  = &can2_mbx_transfer[obj_idx];
#else
    return kStatus_Fail;
#endif
  }
  if ((obj_idx == 0U) && (CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM != 0U)) {       // Rx FIFO object
    ptr_rx_fifo_transfer->frame = (flexcan_frame_t *)ptr_rx_frame;
#if (FSL_FLEXCAN_DRIVER_VERSION >= (MAKE_VERSION(2,9,2)))
    ptr_rx_fifo_transfer->frameNum = 1U;
#endif
    return FLEXCAN_TransferReceiveFifoNonBlocking(can_base[x], &flexcan_handle[x], ptr_rx_fifo_transfer);
  } else {                                                                  // Mailbox object
    mbx_idx = obj_idx + CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS + 1U;
    ptr_rx_mbx_transfer->frame = (flexcan_frame_t *)ptr_rx_frame;
    ptr_rx_mbx_transfer->mbIdx = mbx_idx;
    return FLEXCAN_TransferReceiveNonBlocking(can_base[x], &flexcan_handle[x], ptr_rx_mbx_transfer);
  }
}

/**
  \fn          void CANx_StopReceive (uint32_t obj_idx, uint8_t x)
  \brief       Stop reception on an object.
  \param[in]   obj_idx  Object index
  \param[in]   x        Controller number (0..1)
  \return      execution status
*/
static void CANx_StopReceive (uint32_t obj_idx, uint8_t x) {
  uint32_t mbx_idx;

  if ((obj_idx == 0U) && (CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM != 0U)) {       // Rx FIFO object
    FLEXCAN_TransferAbortReceiveFifo(can_base[x], &flexcan_handle[x]);
  } else {                                                                  // Mailbox object
    mbx_idx = obj_idx + CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS + 1U;
    FLEXCAN_TransferAbortReceive(can_base[x], &flexcan_handle[x], mbx_idx);
  }
}

/**
  \fn          int32_t CANx_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg, uint8_t x)
  \brief       Configure object.
  \param[in]   obj_idx  Object index
  \param[in]   obj_cfg  Object configuration state
                 - ARM_CAN_OBJ_INACTIVE :       deactivate object
                 - ARM_CAN_OBJ_RX :             configure object for reception
                 - ARM_CAN_OBJ_TX :             configure object for transmission
                 - ARM_CAN_OBJ_RX_RTR_TX_DATA : configure object that on RTR reception automatically transmits Data Frame
                 - ARM_CAN_OBJ_TX_RTR_RX_DATA : configure object that transmits RTR and automatically receives Data Frame
  \param[in]   x        Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg, uint8_t x) {
  uint32_t idx, msk;

  if (obj_idx >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }
  if (can_driver_powered[x] == 0U)              { return ARM_DRIVER_ERROR;           }

  idx = obj_idx / 32U;
  msk = 1U << (obj_idx % 32U);

  switch (obj_cfg) {
    case ARM_CAN_OBJ_INACTIVE:
      if ((obj_idx + 1U) >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }
      if ((can_obj_tx[x][idx] &  msk) != 0U) {
        FLEXCAN_SetTxMbConfig(can_base[x], obj_idx + CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS + 1U, false);
      }
      if ((can_obj_rx[x][idx] &  msk) != 0U) {
        CANx_StopReceive (obj_idx, x);
      }
      can_obj_tx[x][idx] &= ~msk;
      can_obj_rx[x][idx] &= ~msk;
      break;

