Open-CMSIS-Pack/NXP_iMXRT105x_MWP/CMSIS/Driver/FLEXCAN_iMXRT105x.c
    case ARM_CAN_OBJ_TX:
      if ((obj_idx + 1U) >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM) { return ARM_DRIVER_ERROR_PARAMETER; }
      if ((can_obj_tx[x][idx] &  msk) != 0U) { break; } 
      can_obj_rx[x][idx] &= ~msk;
      can_obj_tx[x][idx] |=  msk;
      FLEXCAN_SetTxMbConfig(can_base[x], obj_idx + CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS + 1U, true);
      break;

    case ARM_CAN_OBJ_RX:
      if ((can_obj_rx[x][idx] &  msk) != 0U) { break; } 
      can_obj_tx[x][idx] &= ~msk;
      can_obj_rx[x][idx] |=  msk;
      if (CANx_StartReceive (obj_idx, x) != kStatus_Success) {
        can_obj_rx[x][idx] &= ~msk;
        return ARM_DRIVER_ERROR;
      }
      break;

    case ARM_CAN_OBJ_RX_RTR_TX_DATA:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_CAN_OBJ_TX_RTR_RX_DATA:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    default:
      return ARM_DRIVER_ERROR;
  }

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg) { return CANx_ObjectConfigure (obj_idx, obj_cfg, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_ObjectConfigure (uint32_t obj_idx, ARM_CAN_OBJ_CONFIG obj_cfg) { return CANx_ObjectConfigure (obj_idx, obj_cfg, 1U); }
#endif

/**
  \fn          int32_t CANx_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size, uint8_t x)
  \brief       Send message on CAN bus.
  \param[in]   obj_idx  Object index
  \param[in]   msg_info Pointer to CAN message information
  \param[in]   data     Pointer to data buffer
  \param[in]   size     Number of data bytes to send
  \param[in]   x        Controller number (0..1)
  \return      value >= 0  number of data bytes accepted to send
  \return      value < 0   execution status
*/
static int32_t CANx_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size, uint8_t x) {
  volatile flexcan_frame_t       *ptr_tx_frame;
           flexcan_mb_transfer_t *ptr_tx_mbx_transfer;

  if ((obj_idx + 1U) >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM)          { return ARM_DRIVER_ERROR_PARAMETER; }
  if (can_driver_powered[x] == 0U)                              { return ARM_DRIVER_ERROR;           }
  if ((can_obj_tx[x][obj_idx/32U] & (1U<<(obj_idx%32U))) == 0U) { return ARM_DRIVER_ERROR;           }

  if (x == 0U) {
#if (DRIVER_CAN1 == 1U)
    ptr_tx_frame        = &can1_frame[obj_idx];
    ptr_tx_mbx_transfer = &can1_mbx_transfer[obj_idx];
#else
    return ARM_DRIVER_ERROR;
#endif
  } else {
#if (DRIVER_CAN2 == 1U)
    ptr_tx_frame        = &can2_frame[obj_idx];
    ptr_tx_mbx_transfer = &can2_mbx_transfer[obj_idx];
#else
    return ARM_DRIVER_ERROR;
#endif
  }

  if ((msg_info->id & ARM_CAN_ID_IDE_Msk) != 0U) {      // Extended ID
    ptr_tx_frame->id     = (msg_info->id & 0x1FFFFFFFU);
    ptr_tx_frame->format = kFLEXCAN_FrameFormatExtend;
  } else {                                              // Standard ID
    ptr_tx_frame->id     = (msg_info->id & 0x7FFU) << CAN_ID_STD_SHIFT;
    ptr_tx_frame->format = kFLEXCAN_FrameFormatStandard;
  }
  if (msg_info->rtr != 0U) {                            // RTR message
    ptr_tx_frame->type = kFLEXCAN_FrameTypeRemote;
  } else {                                              // Data message
    ptr_tx_frame->type = kFLEXCAN_FrameTypeData;
  }
  ptr_tx_frame->length = size;
  if (size > 0U) { ptr_tx_frame->dataByte0 = *data++; }
  if (size > 1U) { ptr_tx_frame->dataByte1 = *data++; }
  if (size > 2U) { ptr_tx_frame->dataByte2 = *data++; }
  if (size > 3U) { ptr_tx_frame->dataByte3 = *data++; }
  if (size > 4U) { ptr_tx_frame->dataByte4 = *data++; }
  if (size > 5U) { ptr_tx_frame->dataByte5 = *data++; }
  if (size > 6U) { ptr_tx_frame->dataByte6 = *data++; }
  if (size > 7U) { ptr_tx_frame->dataByte7 = *data  ; }

  ptr_tx_mbx_transfer->frame = (flexcan_frame_t *)ptr_tx_frame;
  ptr_tx_mbx_transfer->mbIdx = obj_idx + CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS + 1U;
  if (FLEXCAN_TransferSendNonBlocking(can_base[x], &flexcan_handle[x], ptr_tx_mbx_transfer) == kStatus_Success) {
    return ((int32_t)size);
  }

  return ARM_DRIVER_ERROR;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size) { return CANx_MessageSend (obj_idx, msg_info, data, size, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_MessageSend (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, const uint8_t *data, uint8_t size) { return CANx_MessageSend (obj_idx, msg_info, data, size, 1U); }
#endif

/**
  \fn          int32_t CANx_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size, uint8_t x)
  \brief       Read message received on CAN bus.
  \param[in]   obj_idx  Object index
  \param[out]  msg_info Pointer to read CAN message information
  \param[out]  data     Pointer to data buffer for read data
  \param[in]   size     Maximum number of data bytes to read
  \param[in]   x        Controller number (0..1)
  \return      value >= 0  number of data bytes read
  \return      value < 0   execution status
*/
static int32_t CANx_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size, uint8_t x) {
  volatile flexcan_frame_t *ptr_rx_frame;
           uint32_t         rx_size;

  if (obj_idx >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM)                 { return ARM_DRIVER_ERROR_PARAMETER; }
  if (can_driver_powered[x] == 0U)                              { return ARM_DRIVER_ERROR;           }
  if ((can_obj_rx[x][obj_idx/32U] & (1U<<(obj_idx%32U))) == 0U) { return ARM_DRIVER_ERROR;           }

  // Message is already available in frame
  if ((obj_idx == 0U) && (CAN_DRV_CONFIG[x].RX_FIFO_OBJ_NUM != 0U)) {   // Rx FIFO object
    if (x == 0U) {
#if (DRIVER_CAN1 == 1U)
      ptr_rx_frame = (volatile flexcan_frame_t *)((&can1_fifo_transfer)->frame);
#else
      return ARM_DRIVER_ERROR;
#endif
    } else {
#if (DRIVER_CAN2 == 1U)
      ptr_rx_frame = (volatile flexcan_frame_t *)((&can2_fifo_transfer)->frame);
#else
      return ARM_DRIVER_ERROR;
#endif
    }
  } else {                                                              // Mailbox object
    if (x == 0U) {
#if (DRIVER_CAN1 == 1U)
      ptr_rx_frame = (volatile flexcan_frame_t *)((&can1_mbx_transfer[obj_idx])->frame);
#else
      return ARM_DRIVER_ERROR;
#endif
    } else {
#if (DRIVER_CAN2 == 1U)
      ptr_rx_frame = (volatile flexcan_frame_t *)((&can2_mbx_transfer[obj_idx])->frame);
#else
      return ARM_DRIVER_ERROR;
#endif
    }
  }

  // Extract received data and parameters into msg_info structure
  if (ptr_rx_frame->format == kFLEXCAN_FrameFormatExtend) {             // If Extended ID
    msg_info->id = ( ptr_rx_frame->id & 0x1FFFFFFFU) | ARM_CAN_ID_IDE_Msk;
  } else {                              // If Standard ID               // If Standard ID
    msg_info->id = ((ptr_rx_frame->id >> CAN_ID_STD_SHIFT) & 0x7FFU);
  }
  if (ptr_rx_frame->type == kFLEXCAN_FrameTypeRemote) {                 // If RTR message
    msg_info->rtr = 1U;
  } else {                                                              // If Data message
    msg_info->rtr = 0U;
  }
  msg_info->dlc =  ptr_rx_frame->length;                                // Get Data Length Code
  rx_size       =  ptr_rx_frame->length;
  if (rx_size > 0U) { *data++ = ptr_rx_frame->dataByte0; }
  if (rx_size > 1U) { *data++ = ptr_rx_frame->dataByte1; }
  if (rx_size > 2U) { *data++ = ptr_rx_frame->dataByte2; }
  if (rx_size > 3U) { *data++ = ptr_rx_frame->dataByte3; }
  if (rx_size > 4U) { *data++ = ptr_rx_frame->dataByte4; }
  if (rx_size > 5U) { *data++ = ptr_rx_frame->dataByte5; }
  if (rx_size > 6U) { *data++ = ptr_rx_frame->dataByte6; }
  if (rx_size > 7U) { *data   = ptr_rx_frame->dataByte7; }

  // Start new reception on object that wast just read from
  CANx_StartReceive (obj_idx, x);

  return ((int32_t)rx_size);
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size) { return CANx_MessageRead (obj_idx, msg_info, data, size, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_MessageRead (uint32_t obj_idx, ARM_CAN_MSG_INFO *msg_info, uint8_t *data, uint8_t size) { return CANx_MessageRead (obj_idx, msg_info, data, size, 1U); }
#endif

/**
  \fn          int32_t CANx_Control (uint32_t control, uint32_t arg, uint8_t x)
  \brief       Control CAN interface.
  \param[in]   control  Operation
                 - ARM_CAN_SET_FD_MODE :            set FD operation mode
                 - ARM_CAN_ABORT_MESSAGE_SEND :     abort sending of CAN message
                 - ARM_CAN_CONTROL_RETRANSMISSION : enable/disable automatic retransmission
                 - ARM_CAN_SET_TRANSCEIVER_DELAY :  set transceiver delay
  \param[in]   arg      Argument of operation
  \param[in]   x        Controller number (0..1)
  \return      execution status
*/
static int32_t CANx_Control (uint32_t control, uint32_t arg, uint8_t x) {

