Open-CMSIS-Pack/NXP_iMXRT105x_MWP/CMSIS/Driver/FLEXCAN_iMXRT105x.c
  switch (control & ARM_CAN_CONTROL_Msk) {
    case ARM_CAN_ABORT_MESSAGE_SEND:
      if ((arg + 1U) >= CAN_DRV_CONFIG[x].TOT_OBJ_NUM)      { return ARM_DRIVER_ERROR_PARAMETER; }
      if ((can_obj_tx[x][arg/32U] & (1U<<(arg%32U))) == 0U) { return ARM_DRIVER_ERROR;           }
      if (can_driver_powered[x] == 0U)                      { return ARM_DRIVER_ERROR;           }
      FLEXCAN_TransferAbortSend(can_base[x], &flexcan_handle[x], arg + CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS + 1U);
      break;

    case ARM_CAN_CONTROL_RETRANSMISSION:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_CAN_SET_FD_MODE:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_CAN_SET_TRANSCEIVER_DELAY:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}
#if (DRIVER_CAN1 == 1U)
static int32_t CAN1_Control (uint32_t control, uint32_t arg) { return CANx_Control (control, arg, 0U); }
#endif
#if (DRIVER_CAN2 == 1U)
static int32_t CAN2_Control (uint32_t control, uint32_t arg) { return CANx_Control (control, arg, 1U); }
#endif

/**
  \fn          ARM_CAN_STATUS CAN1_GetStatus ()
  \fn          ARM_CAN_STATUS CAN2_GetStatus ()
  \brief       Get CAN status.
  \return      CAN status ARM_CAN_STATUS
*/
#if (DRIVER_CAN1 == 1U)
static ARM_CAN_STATUS CAN1_GetStatus (void) { return can_status[0]; }
#endif
#if (DRIVER_CAN2 == 1U)
static ARM_CAN_STATUS CAN2_GetStatus (void) { return can_status[1]; }
#endif


// Callback function called from IRQ context
static void IRQ_Callback(CAN_Type *base, flexcan_handle_t *handle, status_t status, uint32_t result, void *userData) {
  uint32_t x, esr1, last_state, obj_idx;

  if (base == can_base[0]) {
    x = 0U;
  } else {
    x = 1U;
  }

  switch (status) {
    case kStatus_FLEXCAN_ErrorStatus:
      esr1 = base->ESR1;
      last_state = can_status[x].unit_state; 

      // Register current unit state status
      switch ((esr1 & CAN_ESR1_FLTCONF_MASK) >> CAN_ESR1_FLTCONF_SHIFT) {
        case 0U:                        // Error Active
          can_status[x].unit_state = ARM_CAN_UNIT_STATE_ACTIVE;
          break;
        case 1U:                        // Error Passive
          can_status[x].unit_state = ARM_CAN_UNIT_STATE_PASSIVE;
          break;
        case 2U:                        // Bus-off
          can_status[x].unit_state = ARM_CAN_UNIT_STATE_BUS_OFF;
          break;
        case 3U:                        // Bus-off
          can_status[x].unit_state = ARM_CAN_UNIT_STATE_BUS_OFF;
          break;
      }

      // Register last error code
      if      ((esr1 & CAN_ESR1_BIT1ERR_MASK) != 0U) { can_status[x].last_error_code = ARM_CAN_LEC_BIT_ERROR;   }
      else if ((esr1 & CAN_ESR1_BIT0ERR_MASK) != 0U) { can_status[x].last_error_code = ARM_CAN_LEC_BIT_ERROR;   }
      else if ((esr1 & CAN_ESR1_ACKERR_MASK)  != 0U) { can_status[x].last_error_code = ARM_CAN_LEC_ACK_ERROR;   }
      else if ((esr1 & CAN_ESR1_CRCERR_MASK)  != 0U) { can_status[x].last_error_code = ARM_CAN_LEC_CRC_ERROR;   }
      else if ((esr1 & CAN_ESR1_FRMERR_MASK)  != 0U) { can_status[x].last_error_code = ARM_CAN_LEC_FORM_ERROR;  }
      else if ((esr1 & CAN_ESR1_STFERR_MASK)  != 0U) { can_status[x].last_error_code = ARM_CAN_LEC_STUFF_ERROR; }
      else                                           { can_status[x].last_error_code = ARM_CAN_LEC_NO_ERROR;    }

      // Estimate error counter values
      switch ((esr1 & CAN_ESR1_FLTCONF_MASK) >> CAN_ESR1_FLTCONF_SHIFT) {
        case 0U:                        // Error Active
          if ((esr1 & CAN_ESR1_TXWRN_MASK) != 0U) {
            can_status[x].tx_error_count = 96U;
          } else {
            can_status[x].tx_error_count = 0U;
          }
          if ((esr1 & CAN_ESR1_RXWRN_MASK) != 0U) {
            can_status[x].rx_error_count = 96U;
          } else {
            can_status[x].rx_error_count = 0U;
          }
          break;
        case 1U:                        // Error Passive
          can_status[x].tx_error_count = 128U;
          can_status[x].rx_error_count = 128U;
          break;
        case 2U:                        // Bus-off
          can_status[x].tx_error_count = 255U;
          can_status[x].rx_error_count = 255U;
          break;
        case 3U:                        // Bus-off
          can_status[x].tx_error_count = 255U;
          can_status[x].rx_error_count = 255U;
          break;
      }

      if      ((result & kFLEXCAN_BusOffIntFlag) != 0U) { CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_BUS_OFF); }
      else if ((last_state ^ can_status[x].unit_state) != 0U) {
        // If unit bus status changed since last call
        switch (can_status[x].unit_state) {
          case ARM_CAN_UNIT_STATE_ACTIVE:
            CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_ACTIVE);
            break;
          case ARM_CAN_UNIT_STATE_PASSIVE:
            CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_PASSIVE);
            break;
          case ARM_CAN_UNIT_STATE_BUS_OFF:
            CAN_SignalUnitEvent[x](ARM_CAN_EVENT_UNIT_BUS_OFF);
            break;
          default:
            break;
        }
      }
      break;

    case kStatus_FLEXCAN_RxFifoIdle:
      CAN_SignalObjectEvent[x](0U, ARM_CAN_EVENT_RECEIVE);
      break;

    case kStatus_FLEXCAN_RxFifoOverflow:
      CAN_SignalObjectEvent[x](0U, ARM_CAN_EVENT_RECEIVE_OVERRUN);
      break;

    case kStatus_FLEXCAN_RxIdle:
      obj_idx = result;
      if (obj_idx > CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS) {
        obj_idx = obj_idx - CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS - 1U;
      }
      CAN_SignalObjectEvent[x](obj_idx, ARM_CAN_EVENT_RECEIVE);
      break;

    case kStatus_FLEXCAN_RxOverflow:
      obj_idx = result;
      if (obj_idx > CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS) {
        obj_idx = obj_idx - CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS - 1U;
      }
      CAN_SignalObjectEvent[x](obj_idx, ARM_CAN_EVENT_RECEIVE_OVERRUN);
      break;

    case kStatus_FLEXCAN_TxIdle:
      obj_idx = result - CAN_DRV_CONFIG[x].RX_MBX_OBJ_OFS - 1U;
      CAN_SignalObjectEvent[x](obj_idx, ARM_CAN_EVENT_SEND_COMPLETE);
      break;

    default:
      break;
  }
}


#if (DRIVER_CAN1 == 1U)
ARM_DRIVER_CAN Driver_CAN1 = {
  CAN_GetVersion,
  CAN1_GetCapabilities,
  CAN1_Initialize,
  CAN1_Uninitialize,
  CAN1_PowerControl,
  CAN_GetClock,
  CAN1_SetBitrate,
  CAN1_SetMode,
  CAN1_ObjectGetCapabilities,
  CAN1_ObjectSetFilter,
  CAN1_ObjectConfigure,
  CAN1_MessageSend,
  CAN1_MessageRead,
  CAN1_Control,
  CAN1_GetStatus
};
#endif

#if (DRIVER_CAN2 == 1U)
ARM_DRIVER_CAN Driver_CAN2 = {
  CAN_GetVersion,
  CAN2_GetCapabilities,
  CAN2_Initialize,
  CAN2_Uninitialize,
  CAN2_PowerControl,
  CAN_GetClock,
  CAN2_SetBitrate,
  CAN2_SetMode,
  CAN2_ObjectGetCapabilities,
  CAN2_ObjectSetFilter,
  CAN2_ObjectConfigure,
  CAN2_MessageSend,
  CAN2_MessageRead,
  CAN2_Control,
  CAN2_GetStatus
};
#endif

/*! \endcond */
